<?php


namespace app\commands;
use yii\console\Controller;
use app\models\Product;

include 'simple_html_dom.php';

$listProduct = array();


class PsGoldController extends ParseController{
    public $categoryId = 544;
    public $manufacturerId = 6;
    public $aSku = [];
    public $aCategory = [];
    public $aSku1c;

	const SKU_NONE 	= 0;
	const SKU_CHAR_NUMBER 	= 1;
	const SKU_NUMBER 		= 2;
	const SKU_NUMBER_NUMBER = 3;

    public function init(){
    	$this->aSku1c = [
[ 'type' => 1, '1c' => '15995', 'char' => 'А', 'number' => '006' ],
[ 'type' => 1, '1c' => '6282', 'char' => 'БР', 'number' => '009' ],
[ 'type' => 1, '1c' => '2133', 'char' => 'БР', 'number' => '015' ],
[ 'type' => 1, '1c' => '17235', 'char' => 'ВК', 'number' => '010' ],
[ 'type' => 1, '1c' => '17236', 'char' => 'ВК', 'number' => '012' ],
[ 'type' => 1, '1c' => '1382', 'char' => 'ВК', 'number' => '016' ],
[ 'type' => 1, '1c' => '16865', 'char' => 'ВК', 'number' => '018' ],
[ 'type' => 1, '1c' => '1379', 'char' => 'ВК', 'number' => '024' ],
[ 'type' => 1, '1c' => '17242', 'char' => 'ВК', 'number' => '026' ],
[ 'type' => 1, '1c' => '13155', 'char' => 'ВК', 'number' => '029' ],
[ 'type' => 1, '1c' => '15395', 'char' => 'ВМ', 'number' => '001' ],
[ 'type' => 1, '1c' => '15878', 'char' => 'ВМ', 'number' => '005' ],
[ 'type' => 1, '1c' => '16980', 'char' => 'ВМ', 'number' => '009' ],
[ 'type' => 1, '1c' => '17234', 'char' => 'ВМ', 'number' => '010' ],
[ 'type' => 1, '1c' => '967', 'char' => 'ВМ', 'number' => '012' ],
[ 'type' => 1, '1c' => '17923', 'char' => 'ВМ', 'number' => '016' ],
[ 'type' => 1, '1c' => '5058', 'char' => 'ВМ', 'number' => '017' ],
[ 'type' => 1, '1c' => '952', 'char' => 'ВМ', 'number' => '019' ],
[ 'type' => 1, '1c' => '1068', 'char' => 'ВМ', 'number' => '020' ],
[ 'type' => 1, '1c' => '1214', 'char' => 'ВМ', 'number' => '021' ],
[ 'type' => 1, '1c' => '15397', 'char' => 'ВМ', 'number' => '023' ],
[ 'type' => 1, '1c' => '13154', 'char' => 'ВМ', 'number' => '025' ],
[ 'type' => 1, '1c' => '1793', 'char' => 'ВС', 'number' => '005' ],
[ 'type' => 1, '1c' => '15996', 'char' => 'ВС', 'number' => '006' ],
[ 'type' => 1, '1c' => '18747', 'char' => 'ВС', 'number' => '008' ],
[ 'type' => 1, '1c' => '1069', 'char' => 'ВС', 'number' => '010' ],
[ 'type' => 1, '1c' => '5009', 'char' => 'ГМ', 'number' => '012' ],
[ 'type' => 1, '1c' => '18496', 'char' => 'ГМ', 'number' => '014' ],
[ 'type' => 1, '1c' => '18375', 'char' => 'ГМ', 'number' => '017' ],
[ 'type' => 1, '1c' => '11062', 'char' => 'ГМ', 'number' => '018' ],
[ 'type' => 1, '1c' => '1384', 'char' => 'ГМ', 'number' => '021' ],
[ 'type' => 1, '1c' => '13731', 'char' => 'ГМ', 'number' => '022' ],
[ 'type' => 1, '1c' => '16073', 'char' => 'ГМ', 'number' => '023' ],
[ 'type' => 1, '1c' => '16958', 'char' => 'ГН', 'number' => '005' ],
[ 'type' => 1, '1c' => '17126', 'char' => 'ГН', 'number' => '006' ],
[ 'type' => 1, '1c' => '1199', 'char' => 'ГН', 'number' => '007' ],
[ 'type' => 1, '1c' => '17127', 'char' => 'ГН', 'number' => '008' ],
[ 'type' => 1, '1c' => '13143', 'char' => 'ГН', 'number' => '013' ],
[ 'type' => 1, '1c' => '5047', 'char' => 'ГН', 'number' => '014' ],
[ 'type' => 1, '1c' => '3244', 'char' => 'ГТ', 'number' => '020' ],
[ 'type' => 1, '1c' => '13153', 'char' => 'ГТ', 'number' => '026' ],
[ 'type' => 1, '1c' => '13737', 'char' => 'ГТ', 'number' => '027' ],
[ 'type' => 1, '1c' => '16844', 'char' => 'ГТ', 'number' => '035' ],
[ 'type' => 1, '1c' => '17250', 'char' => 'ГТ', 'number' => '038' ],
[ 'type' => 1, '1c' => '1542', 'char' => 'ГТ', 'number' => '039' ],
[ 'type' => 1, '1c' => '17924', 'char' => 'ГТ', 'number' => '040' ],
[ 'type' => 1, '1c' => '16577', 'char' => 'ДЖ', 'number' => '018' ],
[ 'type' => 1, '1c' => '16848', 'char' => 'ДЖ', 'number' => '019' ],
[ 'type' => 1, '1c' => '2139', 'char' => 'ДЖ', 'number' => '026' ],
[ 'type' => 1, '1c' => '17926', 'char' => 'ДЖ', 'number' => '027' ],
[ 'type' => 1, '1c' => '1242', 'char' => 'ДЖ', 'number' => '028' ],
[ 'type' => 1, '1c' => '14872', 'char' => 'ДЖ', 'number' => '032' ],
[ 'type' => 1, '1c' => '11650', 'char' => 'ДЖ', 'number' => '033' ],
[ 'type' => 1, '1c' => '3552', 'char' => 'ДЖ', 'number' => '034' ],
[ 'type' => 1, '1c' => '13142', 'char' => 'ДЖ', 'number' => '035' ],
[ 'type' => 1, '1c' => '19187', 'char' => 'ДЖ', 'number' => '036' ],
[ 'type' => 1, '1c' => '966', 'char' => 'ДЛ', 'number' => '022' ],
[ 'type' => 1, '1c' => '14865', 'char' => 'ДЛ', 'number' => '027' ],
[ 'type' => 1, '1c' => '5034', 'char' => 'ДЛ', 'number' => '029' ],
[ 'type' => 1, '1c' => '1376', 'char' => 'ДЛ', 'number' => '030' ],
[ 'type' => 1, '1c' => '19189', 'char' => 'ДЛ', 'number' => '032' ],
[ 'type' => 1, '1c' => '6287', 'char' => 'ДЛ', 'number' => '033' ],
[ 'type' => 1, '1c' => '3539', 'char' => 'З', 'number' => '001' ],
[ 'type' => 1, '1c' => '16433', 'char' => 'З', 'number' => '018' ],
[ 'type' => 1, '1c' => '16430', 'char' => 'З', 'number' => '019' ],
[ 'type' => 1, '1c' => '3246', 'char' => 'З', 'number' => '024' ],
[ 'type' => 1, '1c' => '13191', 'char' => 'З', 'number' => '025' ],
[ 'type' => 1, '1c' => '13144', 'char' => 'З', 'number' => '026' ],
[ 'type' => 1, '1c' => '1383', 'char' => 'З', 'number' => '028' ],
[ 'type' => 1, '1c' => '1268', 'char' => 'З', 'number' => '030' ],
[ 'type' => 1, '1c' => '18499', 'char' => 'З', 'number' => '031' ],
[ 'type' => 1, '1c' => '18500', 'char' => 'З', 'number' => '032' ],
[ 'type' => 1, '1c' => '14874', 'char' => 'З', 'number' => '033' ],
[ 'type' => 1, '1c' => '15423', 'char' => 'З', 'number' => '035' ],
[ 'type' => 1, '1c' => '1271', 'char' => 'З', 'number' => '038' ],
[ 'type' => 1, '1c' => '19191', 'char' => 'З', 'number' => '041' ],
[ 'type' => 1, '1c' => '1287', 'char' => 'З', 'number' => '044' ],
[ 'type' => 1, '1c' => '17252', 'char' => 'ЛП', 'number' => '014' ],
[ 'type' => 1, '1c' => '2686', 'char' => 'ЛП', 'number' => '016' ],
[ 'type' => 1, '1c' => '1773', 'char' => 'ЛП', 'number' => '021' ],
[ 'type' => 1, '1c' => '2684', 'char' => 'ЛП', 'number' => '022' ],
[ 'type' => 1, '1c' => '18316', 'char' => 'ЛП', 'number' => '023' ],
[ 'type' => 1, '1c' => '1344', 'char' => 'ЛП', 'number' => '024' ],
[ 'type' => 1, '1c' => '16862', 'char' => 'ЛП', 'number' => '025' ],
[ 'type' => 1, '1c' => '18318', 'char' => 'ЛП', 'number' => '028' ],
[ 'type' => 1, '1c' => '18508', 'char' => 'ЛП', 'number' => '029' ],
[ 'type' => 1, '1c' => '18509', 'char' => 'ЛП', 'number' => '030' ],
[ 'type' => 1, '1c' => '1220', 'char' => 'ЛП', 'number' => '033' ],
[ 'type' => 1, '1c' => '2685', 'char' => 'ЛП', 'number' => '035' ],
[ 'type' => 1, '1c' => '2162', 'char' => 'ЛП', 'number' => '036' ],
[ 'type' => 1, '1c' => '2113', 'char' => 'ЛП', 'number' => '038' ],
[ 'type' => 1, '1c' => '948', 'char' => 'ЛП', 'number' => '039' ],
[ 'type' => 1, '1c' => '16575', 'char' => 'ЛП', 'number' => '040' ],
[ 'type' => 1, '1c' => '4753', 'char' => 'ЛП', 'number' => '041' ],
[ 'type' => 1, '1c' => '2131', 'char' => 'ЛП', 'number' => '046' ],
[ 'type' => 1, '1c' => '16584', 'char' => 'ЛЦ', 'number' => '023' ],
[ 'type' => 1, '1c' => '16852', 'char' => 'ЛЦ', 'number' => '026' ],
[ 'type' => 1, '1c' => '16853', 'char' => 'ЛЦ', 'number' => '027' ],
[ 'type' => 1, '1c' => '17129', 'char' => 'ЛЦ', 'number' => '031' ],
[ 'type' => 1, '1c' => '17130', 'char' => 'ЛЦ', 'number' => '032' ],
[ 'type' => 1, '1c' => '2169', 'char' => 'ЛЦ', 'number' => '034' ],
[ 'type' => 1, '1c' => '2166', 'char' => 'ЛЦ', 'number' => '037' ],
[ 'type' => 1, '1c' => '5041', 'char' => 'ЛЦ', 'number' => '039' ],
[ 'type' => 1, '1c' => '8112', 'char' => 'ЛЦ', 'number' => '042' ],
[ 'type' => 1, '1c' => '11049', 'char' => 'ЛЦ', 'number' => '043' ],
[ 'type' => 1, '1c' => '18735', 'char' => 'ЛЦ', 'number' => '045' ],
[ 'type' => 1, '1c' => '18736', 'char' => 'ЛЦ', 'number' => '046' ],
[ 'type' => 1, '1c' => '1284', 'char' => 'ЛЦ', 'number' => '048' ],
[ 'type' => 1, '1c' => '979', 'char' => 'ЛЦ', 'number' => '049' ],
[ 'type' => 1, '1c' => '1431', 'char' => 'ЛЦ', 'number' => '050' ],
[ 'type' => 1, '1c' => '13157', 'char' => 'ЛЦ', 'number' => '053' ],
[ 'type' => 1, '1c' => '17370', 'char' => 'ЛЦ', 'number' => '054' ],
[ 'type' => 1, '1c' => '17422', 'char' => 'ЛЦ', 'number' => '055' ],
[ 'type' => 1, '1c' => '17930', 'char' => 'МГ', 'number' => '009' ],
[ 'type' => 1, '1c' => '2192', 'char' => 'МГ', 'number' => '011' ],
[ 'type' => 1, '1c' => '18737', 'char' => 'МГ', 'number' => '013' ],
[ 'type' => 1, '1c' => '17317', 'char' => 'МГ', 'number' => '017' ],
[ 'type' => 1, '1c' => '16968', 'char' => 'МД', 'number' => '007' ],
[ 'type' => 1, '1c' => '11651', 'char' => 'МД', 'number' => '010' ],
[ 'type' => 1, '1c' => '15403', 'char' => 'МД', 'number' => '011' ],
[ 'type' => 1, '1c' => '17426', 'char' => 'МД', 'number' => '014' ],
[ 'type' => 1, '1c' => '3102', 'char' => 'МД', 'number' => '016' ],
[ 'type' => 1, '1c' => '947', 'char' => 'МК', 'number' => '004' ],
[ 'type' => 1, '1c' => '17257', 'char' => 'МК', 'number' => '007' ],
[ 'type' => 1, '1c' => '18512', 'char' => 'МК', 'number' => '010' ],
[ 'type' => 1, '1c' => '2505', 'char' => 'МК', 'number' => '011' ],
[ 'type' => 1, '1c' => '5006', 'char' => 'МК', 'number' => '012' ],
[ 'type' => 1, '1c' => '13137', 'char' => 'МК', 'number' => '013' ],
[ 'type' => 1, '1c' => '17933', 'char' => 'МК', 'number' => '015' ],
[ 'type' => 1, '1c' => '17934', 'char' => 'МК', 'number' => '016' ],
[ 'type' => 1, '1c' => '17935', 'char' => 'МК', 'number' => '017' ],
[ 'type' => 1, '1c' => '17936', 'char' => 'МК', 'number' => '018' ],
[ 'type' => 1, '1c' => '1343', 'char' => 'МК', 'number' => '019' ],
[ 'type' => 1, '1c' => '18319', 'char' => 'МК', 'number' => '020' ],
[ 'type' => 1, '1c' => '18320', 'char' => 'МК', 'number' => '021' ],
[ 'type' => 1, '1c' => '18377', 'char' => 'МК', 'number' => '022' ],
[ 'type' => 1, '1c' => '18738', 'char' => 'МК', 'number' => '023' ],
[ 'type' => 1, '1c' => '16588', 'char' => 'МК', 'number' => '024' ],
[ 'type' => 1, '1c' => '972', 'char' => 'МК', 'number' => '025' ],
[ 'type' => 1, '1c' => '3599', 'char' => 'МК', 'number' => '026' ],
[ 'type' => 1, '1c' => '16573', 'char' => 'МК', 'number' => '028' ],
[ 'type' => 1, '1c' => '16246', 'char' => 'МК', 'number' => '029' ],
[ 'type' => 1, '1c' => '2536', 'char' => 'МК', 'number' => '030' ],
[ 'type' => 1, '1c' => '2641', 'char' => 'МК', 'number' => '032' ],
[ 'type' => 1, '1c' => '8201', 'char' => 'МК', 'number' => '033' ],
[ 'type' => 1, '1c' => '9434', 'char' => 'МК', 'number' => '034' ],
[ 'type' => 1, '1c' => '11943', 'char' => 'МК', 'number' => '035' ],
[ 'type' => 1, '1c' => '16427', 'char' => 'МЛ', 'number' => '012' ],
[ 'type' => 1, '1c' => '16972', 'char' => 'НЛ', 'number' => '015' ],
[ 'type' => 1, '1c' => '3542', 'char' => 'НЛ', 'number' => '017' ],
[ 'type' => 1, '1c' => '18739', 'char' => 'НЛ', 'number' => '018' ],
[ 'type' => 1, '1c' => '3548', 'char' => 'НЛ', 'number' => '019' ],
[ 'type' => 1, '1c' => '13132', 'char' => 'НЛ', 'number' => '025' ],
[ 'type' => 1, '1c' => '1373', 'char' => 'НЛ', 'number' => '027' ],
[ 'type' => 1, '1c' => '2138', 'char' => 'НЛ', 'number' => '029' ],
[ 'type' => 1, '1c' => '13139', 'char' => 'НЛ', 'number' => '030' ],
[ 'type' => 1, '1c' => '2125', 'char' => 'НЛ', 'number' => '032' ],
[ 'type' => 1, '1c' => '15404', 'char' => 'ПИ', 'number' => '001' ],
[ 'type' => 1, '1c' => '9643', 'char' => 'ПИ', 'number' => '002' ],
[ 'type' => 1, '1c' => '17259', 'char' => 'ПИ', 'number' => '009' ],
[ 'type' => 1, '1c' => '17260', 'char' => 'ПИ', 'number' => '010' ],
[ 'type' => 1, '1c' => '16973', 'char' => 'ПФ', 'number' => '007' ],
[ 'type' => 1, '1c' => '1270', 'char' => 'ПФ', 'number' => '008' ],
[ 'type' => 1, '1c' => '11053', 'char' => 'ПФ', 'number' => '010' ],
[ 'type' => 1, '1c' => '18321', 'char' => 'ПФ', 'number' => '012' ],
[ 'type' => 1, '1c' => '11067', 'char' => 'РП', 'number' => '007' ],
[ 'type' => 1, '1c' => '13129', 'char' => 'РП', 'number' => '008' ],
[ 'type' => 1, '1c' => '15417', 'char' => 'РП', 'number' => '009' ],
[ 'type' => 1, '1c' => '16597', 'char' => 'РП', 'number' => '010' ],
[ 'type' => 1, '1c' => '16136', 'char' => 'РС', 'number' => '010' ],
[ 'type' => 1, '1c' => '18322', 'char' => 'РС', 'number' => '013' ],
[ 'type' => 1, '1c' => '16435', 'char' => 'РС', 'number' => '017' ],
[ 'type' => 1, '1c' => '16866', 'char' => 'РС', 'number' => '020' ],
[ 'type' => 1, '1c' => '13729', 'char' => 'С', 'number' => '001' ],
[ 'type' => 1, '1c' => '15421', 'char' => 'С', 'number' => '003' ],
[ 'type' => 1, '1c' => '17133', 'char' => 'С', 'number' => '005' ],
[ 'type' => 1, '1c' => '17261', 'char' => 'С', 'number' => '006' ],
[ 'type' => 1, '1c' => '17262', 'char' => 'С', 'number' => '007' ],
[ 'type' => 1, '1c' => '13193', 'char' => 'С', 'number' => '008' ],
[ 'type' => 1, '1c' => '13127', 'char' => 'СВ', 'number' => '001' ],
[ 'type' => 1, '1c' => '13464', 'char' => 'СВ', 'number' => '003' ],
[ 'type' => 1, '1c' => '15401', 'char' => 'СВ', 'number' => '005' ],
[ 'type' => 1, '1c' => '15412', 'char' => 'СВ', 'number' => '007' ],
[ 'type' => 1, '1c' => '1771', 'char' => 'СВ', 'number' => '010' ],
[ 'type' => 1, '1c' => '15873', 'char' => 'СВ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1219', 'char' => 'СВ', 'number' => '013' ],
[ 'type' => 1, '1c' => '17263', 'char' => 'СВ', 'number' => '014' ],
[ 'type' => 1, '1c' => '17264', 'char' => 'СВ', 'number' => '016' ],
[ 'type' => 1, '1c' => '18323', 'char' => 'СВ', 'number' => '017' ],
[ 'type' => 1, '1c' => '971', 'char' => 'СВ', 'number' => '018' ],
[ 'type' => 1, '1c' => '18324', 'char' => 'СВ', 'number' => '019' ],
[ 'type' => 1, '1c' => '18384', 'char' => 'СВ', 'number' => '020' ],
[ 'type' => 1, '1c' => '18515', 'char' => 'СВ', 'number' => '021' ],
[ 'type' => 1, '1c' => '18742', 'char' => 'СВ', 'number' => '022' ],
[ 'type' => 1, '1c' => '18743', 'char' => 'СВ', 'number' => '023' ],
[ 'type' => 1, '1c' => '16589', 'char' => 'СВ', 'number' => '024' ],
[ 'type' => 1, '1c' => '1252', 'char' => 'СВ', 'number' => '025' ],
[ 'type' => 1, '1c' => '15425', 'char' => 'СВ', 'number' => '026' ],
[ 'type' => 1, '1c' => '15828', 'char' => 'СВ', 'number' => '027' ],
[ 'type' => 1, '1c' => '18516', 'char' => 'СЖ', 'number' => '012' ],
[ 'type' => 1, '1c' => '1272', 'char' => 'СЖ', 'number' => '016' ],
[ 'type' => 1, '1c' => '11064', 'char' => 'СЖ', 'number' => '017' ],
[ 'type' => 1, '1c' => '18744', 'char' => 'СЖ', 'number' => '026' ],
[ 'type' => 1, '1c' => '978', 'char' => 'СЖ', 'number' => '027' ],
[ 'type' => 1, '1c' => '18746', 'char' => 'СЖ', 'number' => '029' ],
[ 'type' => 1, '1c' => '16976', 'char' => 'СМ', 'number' => '012' ],
[ 'type' => 1, '1c' => '15398', 'char' => 'СМ', 'number' => '016' ],
[ 'type' => 1, '1c' => '1244', 'char' => 'СМ', 'number' => '018' ],
[ 'type' => 1, '1c' => '2681', 'char' => 'Ф', 'number' => '006' ],
[ 'type' => 1, '1c' => '2142', 'char' => 'Ф', 'number' => '020' ],
[ 'type' => 1, '1c' => '1275', 'char' => 'Ф', 'number' => '021' ],
[ 'type' => 1, '1c' => '961', 'char' => 'Ф', 'number' => '023' ],
[ 'type' => 1, '1c' => '1339', 'char' => 'Ф', 'number' => '027' ],
[ 'type' => 1, '1c' => '5027', 'char' => 'Ф', 'number' => '028' ],
[ 'type' => 1, '1c' => '18926', 'char' => 'Ф', 'number' => '029' ],
[ 'type' => 1, '1c' => '18927', 'char' => 'Ф', 'number' => '030' ],
[ 'type' => 1, '1c' => '18929', 'char' => 'Ф', 'number' => '032' ],
[ 'type' => 1, '1c' => '991', 'char' => 'ЦК', 'number' => '001' ],
[ 'type' => 1, '1c' => '989', 'char' => 'ЦК', 'number' => '002' ],
[ 'type' => 1, '1c' => '990', 'char' => 'ЦК', 'number' => '003' ],
[ 'type' => 1, '1c' => '988', 'char' => 'ЦК', 'number' => '004' ],
[ 'type' => 1, '1c' => '13123', 'char' => 'ЧМ', 'number' => '003' ],
[ 'type' => 1, '1c' => '15406', 'char' => 'ЧМ', 'number' => '005' ],
[ 'type' => 1, '1c' => '993', 'char' => 'ЧМ', 'number' => '008' ],
[ 'type' => 1, '1c' => '1279', 'char' => 'ЧМ', 'number' => '014' ],
[ 'type' => 1, '1c' => '16604', 'char' => 'ЧМ', 'number' => '015' ],
[ 'type' => 1, '1c' => '1228', 'char' => 'ЧМ', 'number' => '016' ],
[ 'type' => 1, '1c' => '17942', 'char' => 'ЧМ', 'number' => '017' ],
[ 'type' => 1, '1c' => '17943', 'char' => 'ЧМ', 'number' => '018' ],
[ 'type' => 1, '1c' => '1248', 'char' => 'ЧМ', 'number' => '019' ],
[ 'type' => 1, '1c' => '1540', 'char' => 'ЧМ', 'number' => '020' ],
[ 'type' => 1, '1c' => '1385', 'char' => 'ЧМ', 'number' => '021' ],
[ 'type' => 1, '1c' => '18325', 'char' => 'ЧМ', 'number' => '022' ],
[ 'type' => 1, '1c' => '18326', 'char' => 'ЧМ', 'number' => '023' ],
[ 'type' => 1, '1c' => '18749', 'char' => 'ЧМ', 'number' => '026' ],
[ 'type' => 1, '1c' => '18750', 'char' => 'ЧМ', 'number' => '027' ],
[ 'type' => 1, '1c' => '13461', 'char' => 'ЧМ', 'number' => '028' ],
[ 'type' => 1, '1c' => '18882', 'char' => 'ЧМ', 'number' => '029' ],
[ 'type' => 1, '1c' => '16579', 'char' => 'ЧМ', 'number' => '031' ],
[ 'type' => 1, '1c' => '14868', 'char' => 'ЧМ', 'number' => '033' ],
[ 'type' => 1, '1c' => '10110', 'char' => 'ЧМ', 'number' => '034' ],
[ 'type' => 1, '1c' => '1784', 'char' => 'ЧМ', 'number' => '035' ],
[ 'type' => 1, '1c' => '18931', 'char' => 'ЧМ', 'number' => '037' ],
[ 'type' => 1, '1c' => '18933', 'char' => 'ЧМ', 'number' => '039' ],
[ 'type' => 1, '1c' => '19216', 'char' => 'ЧМ', 'number' => '040' ],
[ 'type' => 1, '1c' => '18934', 'char' => 'ЧМ', 'number' => '041' ],
[ 'type' => 1, '1c' => '18935', 'char' => 'ЧМ', 'number' => '042' ],
[ 'type' => 1, '1c' => '18462', 'char' => 'ЧМ', 'number' => '044' ],
[ 'type' => 1, '1c' => '19218', 'char' => 'ЧМ', 'number' => '046' ],
[ 'type' => 1, '1c' => '1224', 'char' => 'Б', 'number' => '013' ],
[ 'type' => 1, '1c' => '2179', 'char' => 'БР', 'number' => '001' ],
[ 'type' => 1, '1c' => '1253', 'char' => 'БР', 'number' => '002' ],
[ 'type' => 1, '1c' => '2178', 'char' => 'БР', 'number' => '003' ],
[ 'type' => 1, '1c' => '1280', 'char' => 'БР', 'number' => '005' ],
[ 'type' => 1, '1c' => '1273', 'char' => 'БР', 'number' => '007' ],
[ 'type' => 1, '1c' => '2522', 'char' => 'БТ', 'number' => '004' ],
[ 'type' => 1, '1c' => '2234', 'char' => 'ГН', 'number' => '004' ],
[ 'type' => 1, '1c' => '963', 'char' => 'ГН', 'number' => '009' ],
[ 'type' => 1, '1c' => '1217', 'char' => 'ГН', 'number' => '010' ],
[ 'type' => 1, '1c' => '2114', 'char' => 'ГО', 'number' => '003' ],
[ 'type' => 1, '1c' => '996', 'char' => 'ГС', 'number' => '003' ],
[ 'type' => 1, '1c' => '3242', 'char' => 'ГТ', 'number' => '001' ],
[ 'type' => 1, '1c' => '2170', 'char' => 'ГТ', 'number' => '008' ],
[ 'type' => 1, '1c' => '2295', 'char' => 'ГТ', 'number' => '022' ],
[ 'type' => 1, '1c' => '16574', 'char' => 'Д', 'number' => '008' ],
[ 'type' => 1, '1c' => '954', 'char' => 'Д', 'number' => '011' ],
[ 'type' => 1, '1c' => '1042', 'char' => 'Д', 'number' => '034' ],
[ 'type' => 1, '1c' => '982', 'char' => 'Д', 'number' => '049' ],
[ 'type' => 1, '1c' => '6293', 'char' => 'ДЖ', 'number' => '005' ],
[ 'type' => 1, '1c' => '11069', 'char' => 'ДЖ', 'number' => '006' ],
[ 'type' => 1, '1c' => '13152', 'char' => 'ДЖ', 'number' => '007' ],
[ 'type' => 1, '1c' => '16849', 'char' => 'ДЖ', 'number' => '020' ],
[ 'type' => 1, '1c' => '16850', 'char' => 'ДЖ', 'number' => '021' ],
[ 'type' => 1, '1c' => '16960', 'char' => 'ДЖ', 'number' => '022' ],
[ 'type' => 1, '1c' => '17269', 'char' => 'ДЖ', 'number' => '024' ],
[ 'type' => 1, '1c' => '1363', 'char' => 'ДЖ', 'number' => '025' ],
[ 'type' => 1, '1c' => '19188', 'char' => 'ДК', 'number' => '004' ],
[ 'type' => 1, '1c' => '2675', 'char' => 'ДЛ', 'number' => '001' ],
[ 'type' => 1, '1c' => '6290', 'char' => 'ДЛ', 'number' => '002' ],
[ 'type' => 1, '1c' => '6291', 'char' => 'ДЛ', 'number' => '003' ],
[ 'type' => 1, '1c' => '15327', 'char' => 'ДЛ', 'number' => '004' ],
[ 'type' => 1, '1c' => '6292', 'char' => 'ДЛ', 'number' => '005' ],
[ 'type' => 1, '1c' => '13146', 'char' => 'ДЛ', 'number' => '010' ],
[ 'type' => 1, '1c' => '13741', 'char' => 'ДЛ', 'number' => '011' ],
[ 'type' => 1, '1c' => '13732', 'char' => 'ДЛ', 'number' => '012' ],
[ 'type' => 1, '1c' => '15867', 'char' => 'ДЛ', 'number' => '017' ],
[ 'type' => 1, '1c' => '16578', 'char' => 'ДЛ', 'number' => '019' ],
[ 'type' => 1, '1c' => '11065', 'char' => 'ДУ', 'number' => '008' ],
[ 'type' => 1, '1c' => '5031', 'char' => 'ДУ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1236', 'char' => 'ЖС', 'number' => '001' ],
[ 'type' => 1, '1c' => '1235', 'char' => 'ЖС', 'number' => '003' ],
[ 'type' => 1, '1c' => '1243', 'char' => 'ЖС', 'number' => '004' ],
[ 'type' => 1, '1c' => '11068', 'char' => 'ЖС', 'number' => '007' ],
[ 'type' => 1, '1c' => '1257', 'char' => 'ЖЦ', 'number' => '002' ],
[ 'type' => 1, '1c' => '1255', 'char' => 'ЖЦ', 'number' => '003' ],
[ 'type' => 1, '1c' => '2186', 'char' => 'З', 'number' => '003' ],
[ 'type' => 1, '1c' => '2687', 'char' => 'З', 'number' => '004' ],
[ 'type' => 1, '1c' => '1278', 'char' => 'З', 'number' => '005' ],
[ 'type' => 1, '1c' => '1342', 'char' => 'З', 'number' => '006' ],
[ 'type' => 1, '1c' => '1262', 'char' => 'З', 'number' => '009' ],
[ 'type' => 1, '1c' => '6294', 'char' => 'З', 'number' => '011' ],
[ 'type' => 1, '1c' => '11073', 'char' => 'З', 'number' => '012' ],
[ 'type' => 1, '1c' => '994', 'char' => 'З', 'number' => '015' ],
[ 'type' => 1, '1c' => '1374', 'char' => 'ЗЗ', 'number' => '002' ],
[ 'type' => 1, '1c' => '1369', 'char' => 'ЗЗ', 'number' => '003' ],
[ 'type' => 1, '1c' => '1371', 'char' => 'ЗЗ', 'number' => '005' ],
[ 'type' => 1, '1c' => '1370', 'char' => 'ЗЗ', 'number' => '006' ],
[ 'type' => 1, '1c' => '5035', 'char' => 'ЗЗ', 'number' => '008' ],
[ 'type' => 1, '1c' => '1281', 'char' => 'ЗМ', 'number' => '001' ],
[ 'type' => 1, '1c' => '2128', 'char' => 'ЗМ', 'number' => '010' ],
[ 'type' => 1, '1c' => '18501', 'char' => 'ЗП', 'number' => '001' ],
[ 'type' => 1, '1c' => '18503', 'char' => 'ЗП', 'number' => '003' ],
[ 'type' => 1, '1c' => '1541', 'char' => 'ЗС', 'number' => '004' ],
[ 'type' => 1, '1c' => '1211', 'char' => 'ЗХ', 'number' => '006' ],
[ 'type' => 1, '1c' => '16070', 'char' => 'ИЛ', 'number' => '003' ],
[ 'type' => 1, '1c' => '16072', 'char' => 'ИЛ', 'number' => '004' ],
[ 'type' => 1, '1c' => '16962', 'char' => 'ИЛ', 'number' => '007' ],
[ 'type' => 1, '1c' => '1266', 'char' => 'К', 'number' => '005' ],
[ 'type' => 1, '1c' => '2193', 'char' => 'К', 'number' => '006' ],
[ 'type' => 1, '1c' => '11070', 'char' => 'К', 'number' => '007' ],
[ 'type' => 1, '1c' => '4768', 'char' => 'К', 'number' => '010' ],
[ 'type' => 1, '1c' => '16580', 'char' => 'КВ', 'number' => '003' ],
[ 'type' => 1, '1c' => '13740', 'char' => 'КВ', 'number' => '005' ],
[ 'type' => 1, '1c' => '16134', 'char' => 'КВ', 'number' => '007' ],
[ 'type' => 1, '1c' => '18505', 'char' => 'КВ', 'number' => '008' ],
[ 'type' => 1, '1c' => '18506', 'char' => 'КВ', 'number' => '009' ],
[ 'type' => 1, '1c' => '18507', 'char' => 'КВ', 'number' => '010' ],
[ 'type' => 1, '1c' => '4755', 'char' => 'КВ', 'number' => '015' ],
[ 'type' => 1, '1c' => '2232', 'char' => 'КК', 'number' => '001' ],
[ 'type' => 1, '1c' => '1286', 'char' => 'КК', 'number' => '003' ],
[ 'type' => 1, '1c' => '2231', 'char' => 'КК', 'number' => '004' ],
[ 'type' => 1, '1c' => '5038', 'char' => 'КЛ', 'number' => '005' ],
[ 'type' => 1, '1c' => '11057', 'char' => 'КЛ', 'number' => '006' ],
[ 'type' => 1, '1c' => '2238', 'char' => 'КП', 'number' => '002' ],
[ 'type' => 1, '1c' => '2122', 'char' => 'КП', 'number' => '011' ],
[ 'type' => 1, '1c' => '2120', 'char' => 'КП', 'number' => '012' ],
[ 'type' => 1, '1c' => '3546', 'char' => 'КП', 'number' => '013' ],
[ 'type' => 1, '1c' => '2121', 'char' => 'КП', 'number' => '014' ],
[ 'type' => 1, '1c' => '2136', 'char' => 'КП', 'number' => '015' ],
[ 'type' => 1, '1c' => '3245', 'char' => 'КП', 'number' => '016' ],
[ 'type' => 1, '1c' => '1769', 'char' => 'ЛЖ', 'number' => '001' ],
[ 'type' => 1, '1c' => '2124', 'char' => 'ЛЖ', 'number' => '002' ],
[ 'type' => 1, '1c' => '2123', 'char' => 'ЛЖ', 'number' => '003' ],
[ 'type' => 1, '1c' => '6296', 'char' => 'ЛП', 'number' => '002' ],
[ 'type' => 1, '1c' => '15407', 'char' => 'ЛП', 'number' => '004' ],
[ 'type' => 1, '1c' => '16002', 'char' => 'ЛП', 'number' => '007' ],
[ 'type' => 1, '1c' => '11652', 'char' => 'ЛП', 'number' => '017' ],
[ 'type' => 1, '1c' => '2183', 'char' => 'ЛП', 'number' => '019' ],
[ 'type' => 1, '1c' => '18317', 'char' => 'ЛП', 'number' => '027' ],
[ 'type' => 1, '1c' => '2296', 'char' => 'ЛП', 'number' => '031' ],
[ 'type' => 1, '1c' => '5045', 'char' => 'ЛП', 'number' => '032' ],
[ 'type' => 1, '1c' => '3550', 'char' => 'ЛП', 'number' => '034' ],
[ 'type' => 1, '1c' => '6297', 'char' => 'ЛП', 'number' => '037' ],
[ 'type' => 1, '1c' => '16581', 'char' => 'ЛС', 'number' => '002' ],
[ 'type' => 1, '1c' => '17927', 'char' => 'ЛС', 'number' => '003' ],
[ 'type' => 1, '1c' => '3551', 'char' => 'ЛЦ', 'number' => '001' ],
[ 'type' => 1, '1c' => '16457', 'char' => 'ЛЦ', 'number' => '018' ],
[ 'type' => 1, '1c' => '16965', 'char' => 'ЛЦ', 'number' => '029' ],
[ 'type' => 1, '1c' => '17254', 'char' => 'ЛЦ', 'number' => '033' ],
[ 'type' => 1, '1c' => '17932', 'char' => 'МК', 'number' => '014' ],
[ 'type' => 1, '1c' => '1341', 'char' => 'МЛ', 'number' => '011' ],
[ 'type' => 1, '1c' => '18513', 'char' => 'МЛ', 'number' => '014' ],
[ 'type' => 1, '1c' => '18378', 'char' => 'ММ', 'number' => '009' ],
[ 'type' => 1, '1c' => '16858', 'char' => 'МС', 'number' => '001' ],
[ 'type' => 1, '1c' => '16857', 'char' => 'МС', 'number' => '002' ],
[ 'type' => 1, '1c' => '1783', 'char' => 'Н', 'number' => '002' ],
[ 'type' => 1, '1c' => '13136', 'char' => 'НА', 'number' => '002' ],
[ 'type' => 1, '1c' => '16135', 'char' => 'НВ', 'number' => '003' ],
[ 'type' => 1, '1c' => '5044', 'char' => 'НЛ', 'number' => '003' ],
[ 'type' => 1, '1c' => '2195', 'char' => 'НЛ', 'number' => '006' ],
[ 'type' => 1, '1c' => '1260', 'char' => 'НЛ', 'number' => '010' ],
[ 'type' => 1, '1c' => '18740', 'char' => 'НЛ', 'number' => '024' ],
[ 'type' => 1, '1c' => '16583', 'char' => 'НЛ', 'number' => '031' ],
[ 'type' => 1, '1c' => '14212', 'char' => 'НЛ', 'number' => '037' ],
[ 'type' => 1, '1c' => '2502', 'char' => 'НО', 'number' => '002' ],
[ 'type' => 1, '1c' => '2116', 'char' => 'НС', 'number' => '001' ],
[ 'type' => 1, '1c' => '6298', 'char' => 'НС', 'number' => '002' ],
[ 'type' => 1, '1c' => '13135', 'char' => 'НС', 'number' => '003' ],
[ 'type' => 1, '1c' => '13133', 'char' => 'НС', 'number' => '005' ],
[ 'type' => 1, '1c' => '14869', 'char' => 'НС', 'number' => '007' ],
[ 'type' => 1, '1c' => '13744', 'char' => 'НТ', 'number' => '001' ],
[ 'type' => 1, '1c' => '16591', 'char' => 'ОТ', 'number' => '010' ],
[ 'type' => 1, '1c' => '16592', 'char' => 'ОТ', 'number' => '011' ],
[ 'type' => 1, '1c' => '11692', 'char' => 'ОЮ', 'number' => '003' ],
[ 'type' => 1, '1c' => '11058', 'char' => 'ОЮ', 'number' => '006' ],
[ 'type' => 1, '1c' => '13463', 'char' => 'П', 'number' => '001' ],
[ 'type' => 1, '1c' => '13131', 'char' => 'П', 'number' => '002' ],
[ 'type' => 1, '1c' => '16429', 'char' => 'ПИ', 'number' => '008' ],
[ 'type' => 1, '1c' => '3540', 'char' => 'ПЛ', 'number' => '002' ],
[ 'type' => 1, '1c' => '3241', 'char' => 'ПЛ', 'number' => '004' ],
[ 'type' => 1, '1c' => '2286', 'char' => 'ПМ', 'number' => '003' ],
[ 'type' => 1, '1c' => '2140', 'char' => 'ПР', 'number' => '002' ],
[ 'type' => 1, '1c' => '11740', 'char' => 'ПС', 'number' => '001' ],
[ 'type' => 1, '1c' => '13465', 'char' => 'ПС', 'number' => '002' ],
[ 'type' => 1, '1c' => '986', 'char' => 'ПФ', 'number' => '005' ],
[ 'type' => 1, '1c' => '16594', 'char' => 'ПФ', 'number' => '006' ],
[ 'type' => 1, '1c' => '11721', 'char' => 'ПФ', 'number' => '009' ],
[ 'type' => 1, '1c' => '5051', 'char' => 'ПФ', 'number' => '013' ],
[ 'type' => 1, '1c' => '2237', 'char' => 'ПЦ', 'number' => '003' ],
[ 'type' => 1, '1c' => '2242', 'char' => 'Р', 'number' => '002' ],
[ 'type' => 1, '1c' => '16595', 'char' => 'Р', 'number' => '006' ],
[ 'type' => 1, '1c' => '16596', 'char' => 'РП', 'number' => '001' ],
[ 'type' => 1, '1c' => '1347', 'char' => 'РП', 'number' => '002' ],
[ 'type' => 1, '1c' => '1770', 'char' => 'РП', 'number' => '004' ],
[ 'type' => 1, '1c' => '1779', 'char' => 'РП', 'number' => '005' ],
[ 'type' => 1, '1c' => '5054', 'char' => 'РП', 'number' => '006' ],
[ 'type' => 1, '1c' => '16598', 'char' => 'РП', 'number' => '011' ],
[ 'type' => 1, '1c' => '2196', 'char' => 'РС', 'number' => '001' ],
[ 'type' => 1, '1c' => '1346', 'char' => 'РС', 'number' => '004' ],
[ 'type' => 1, '1c' => '2197', 'char' => 'РС', 'number' => '005' ],
[ 'type' => 1, '1c' => '13734', 'char' => 'РС', 'number' => '008' ],
[ 'type' => 1, '1c' => '16074', 'char' => 'РС', 'number' => '009' ],
[ 'type' => 1, '1c' => '16974', 'char' => 'РС', 'number' => '011' ],
[ 'type' => 1, '1c' => '18741', 'char' => 'РС', 'number' => '014' ],
[ 'type' => 1, '1c' => '5048', 'char' => 'РТ', 'number' => '020' ],
[ 'type' => 1, '1c' => '5037', 'char' => 'РТ', 'number' => '021' ],
[ 'type' => 1, '1c' => '2233', 'char' => 'РТ', 'number' => '023' ],
[ 'type' => 1, '1c' => '1336', 'char' => 'РТ', 'number' => '024' ],
[ 'type' => 1, '1c' => '13141', 'char' => 'РТ', 'number' => '025' ],
[ 'type' => 1, '1c' => '13195', 'char' => 'РТ', 'number' => '026' ],
[ 'type' => 1, '1c' => '18748', 'char' => 'РТ', 'number' => '027' ],
[ 'type' => 1, '1c' => '18920', 'char' => 'РТ', 'number' => '028' ],
[ 'type' => 1, '1c' => '18922', 'char' => 'РТ', 'number' => '036' ],
[ 'type' => 1, '1c' => '18923', 'char' => 'РТ', 'number' => '037' ],
[ 'type' => 1, '1c' => '9241', 'char' => 'РТ', 'number' => '042' ],
[ 'type' => 1, '1c' => '19192', 'char' => 'РТ', 'number' => '074' ],
[ 'type' => 1, '1c' => '17892', 'char' => 'РТ', 'number' => '076' ],
[ 'type' => 1, '1c' => '13130', 'char' => 'С', 'number' => '010' ],
[ 'type' => 1, '1c' => '2141', 'char' => 'С', 'number' => '012' ],
[ 'type' => 1, '1c' => '13728', 'char' => 'СВ', 'number' => '002' ],
[ 'type' => 1, '1c' => '14866', 'char' => 'СВ', 'number' => '004' ],
[ 'type' => 1, '1c' => '15419', 'char' => 'СВ', 'number' => '006' ],
[ 'type' => 1, '1c' => '15420', 'char' => 'СВ', 'number' => '008' ],
[ 'type' => 1, '1c' => '15405', 'char' => 'СВ', 'number' => '009' ],
[ 'type' => 1, '1c' => '2677', 'char' => 'СГ', 'number' => '002' ],
[ 'type' => 1, '1c' => '3543', 'char' => 'СГ', 'number' => '003' ],
[ 'type' => 1, '1c' => '1788', 'char' => 'СГ', 'number' => '004' ],
[ 'type' => 1, '1c' => '15399', 'char' => 'СЖ', 'number' => '006' ],
[ 'type' => 1, '1c' => '11741', 'char' => 'СЖ', 'number' => '007' ],
[ 'type' => 1, '1c' => '2135', 'char' => 'СЖ', 'number' => '009' ],
[ 'type' => 1, '1c' => '2181', 'char' => 'СЖ', 'number' => '011' ],
[ 'type' => 1, '1c' => '2134', 'char' => 'СЖ', 'number' => '015' ],
[ 'type' => 1, '1c' => '1792', 'char' => 'СЖ', 'number' => '021' ],
[ 'type' => 1, '1c' => '18380', 'char' => 'СЖ', 'number' => '024' ],
[ 'type' => 1, '1c' => '18381', 'char' => 'СЖ', 'number' => '025' ],
[ 'type' => 1, '1c' => '16867', 'char' => 'СК', 'number' => '002' ],
[ 'type' => 1, '1c' => '17585', 'char' => 'СК', 'number' => '003' ],
[ 'type' => 1, '1c' => '11055', 'char' => 'СМ', 'number' => '007' ],
[ 'type' => 1, '1c' => '13743', 'char' => 'СМ', 'number' => '009' ],
[ 'type' => 1, '1c' => '16260', 'char' => 'СМ', 'number' => '010' ],
[ 'type' => 1, '1c' => '16599', 'char' => 'СМ', 'number' => '011' ],
[ 'type' => 1, '1c' => '17268', 'char' => 'СМ', 'number' => '015' ],
[ 'type' => 1, '1c' => '17940', 'char' => 'СМ', 'number' => '019' ],
[ 'type' => 1, '1c' => '18518', 'char' => 'СМ', 'number' => '020' ],
[ 'type' => 1, '1c' => '11060', 'char' => 'СМ', 'number' => '022' ],
[ 'type' => 1, '1c' => '14864', 'char' => 'СМ', 'number' => '08' ],
[ 'type' => 1, '1c' => '6299', 'char' => 'СН', 'number' => '001' ],
[ 'type' => 1, '1c' => '5055', 'char' => 'СО', 'number' => '003' ],
[ 'type' => 1, '1c' => '11054', 'char' => 'СО', 'number' => '004' ],
[ 'type' => 1, '1c' => '13735', 'char' => 'СО', 'number' => '006' ],
[ 'type' => 1, '1c' => '5056', 'char' => 'СО', 'number' => '008' ],
[ 'type' => 1, '1c' => '1778', 'char' => 'СС', 'number' => '001' ],
[ 'type' => 1, '1c' => '2145', 'char' => 'СС', 'number' => '002' ],
[ 'type' => 1, '1c' => '2144', 'char' => 'СС', 'number' => '003' ],
[ 'type' => 1, '1c' => '2168', 'char' => 'СУ', 'number' => '001' ],
[ 'type' => 1, '1c' => '1203', 'char' => 'СШ', 'number' => '002' ],
[ 'type' => 1, '1c' => '16600', 'char' => 'СШ', 'number' => '005' ],
[ 'type' => 1, '1c' => '1794', 'char' => 'Т', 'number' => '002' ],
[ 'type' => 1, '1c' => '6300', 'char' => 'ТВ', 'number' => '003' ],
[ 'type' => 1, '1c' => '6301', 'char' => 'ТН', 'number' => '003' ],
[ 'type' => 1, '1c' => '2130', 'char' => 'ТН', 'number' => '006' ],
[ 'type' => 1, '1c' => '16603', 'char' => 'ТЯ', 'number' => '002' ],
[ 'type' => 1, '1c' => '2221', 'char' => 'Ф', 'number' => '002' ],
[ 'type' => 1, '1c' => '2220', 'char' => 'Ф', 'number' => '003' ],
[ 'type' => 1, '1c' => '2219', 'char' => 'Ф', 'number' => '004' ],
[ 'type' => 1, '1c' => '2285', 'char' => 'Ф', 'number' => '008' ],
[ 'type' => 1, '1c' => '11059', 'char' => 'Ф', 'number' => '011' ],
[ 'type' => 1, '1c' => '13125', 'char' => 'Ф', 'number' => '012' ],
[ 'type' => 1, '1c' => '13124', 'char' => 'Ф', 'number' => '013' ],
[ 'type' => 1, '1c' => '959', 'char' => 'Ф', 'number' => '015' ],
[ 'type' => 1, '1c' => '15394', 'char' => 'Ф', 'number' => '016' ],
[ 'type' => 1, '1c' => '16606', 'char' => 'Ф', 'number' => '017' ],
[ 'type' => 1, '1c' => '16860', 'char' => 'Ф', 'number' => '018' ],
[ 'type' => 1, '1c' => '968', 'char' => 'Ф', 'number' => '024' ],
[ 'type' => 1, '1c' => '1201', 'char' => 'ФИ', 'number' => '003' ],
[ 'type' => 1, '1c' => '2115', 'char' => 'ФИ', 'number' => '004' ],
[ 'type' => 1, '1c' => '16861', 'char' => 'ФИ', 'number' => '006' ],
[ 'type' => 1, '1c' => '958', 'char' => 'ФИ', 'number' => '007' ],
[ 'type' => 1, '1c' => '2163', 'char' => 'ФИ', 'number' => '009' ],
[ 'type' => 1, '1c' => '2182', 'char' => 'ФС', 'number' => '001' ],
[ 'type' => 1, '1c' => '11718', 'char' => 'ФТ', 'number' => '002' ],
[ 'type' => 1, '1c' => '18382', 'char' => 'ХК', 'number' => '013' ],
[ 'type' => 1, '1c' => '1258', 'char' => 'ЦК', 'number' => '010' ],
[ 'type' => 1, '1c' => '16608', 'char' => 'ЦК', 'number' => '012' ],
[ 'type' => 1, '1c' => '16864', 'char' => 'ЦК', 'number' => '015' ],
[ 'type' => 1, '1c' => '1225', 'char' => 'ЦП', 'number' => '005' ],
[ 'type' => 1, '1c' => '16137', 'char' => 'ЧМ', 'number' => '007' ],
[ 'type' => 1, '1c' => '16609', 'char' => 'ЧМ', 'number' => '009' ],
[ 'type' => 1, '1c' => '18383', 'char' => 'ЧМ', 'number' => '025' ],
[ 'type' => 1, '1c' => '18930', 'char' => 'ЧМ', 'number' => '036' ],
[ 'type' => 1, '1c' => '16138', 'char' => 'ЧС', 'number' => '001' ],
[ 'type' => 1, '1c' => '1276', 'char' => 'Э', 'number' => '006' ],
[ 'type' => 1, '1c' => '2257', 'char' => 'ЯС', 'number' => '004' ],
[ 'type' => 1, '1c' => '15875', 'char' => 'А', 'number' => '002' ],
[ 'type' => 1, '1c' => '13158', 'char' => 'АИ', 'number' => '007' ],
[ 'type' => 1, '1c' => '13156', 'char' => 'АМ', 'number' => '002' ],
[ 'type' => 1, '1c' => '16571', 'char' => 'Б', 'number' => '008' ],
[ 'type' => 1, '1c' => '1775', 'char' => 'БР', 'number' => '008' ],
[ 'type' => 1, '1c' => '6283', 'char' => 'БР', 'number' => '010' ],
[ 'type' => 1, '1c' => '13727', 'char' => 'БР', 'number' => '011' ],
[ 'type' => 1, '1c' => '2523', 'char' => 'БР', 'number' => '014' ],
[ 'type' => 1, '1c' => '11063', 'char' => 'БР', 'number' => '016' ],
[ 'type' => 1, '1c' => '1438', 'char' => 'БС', 'number' => '004' ],
[ 'type' => 1, '1c' => '962', 'char' => 'БТ', 'number' => '001' ],
[ 'type' => 1, '1c' => '16605', 'char' => 'БТ', 'number' => '002' ],
[ 'type' => 1, '1c' => '13190', 'char' => 'БТ', 'number' => '003' ],
[ 'type' => 1, '1c' => '5026', 'char' => 'БФ', 'number' => '001' ],
[ 'type' => 1, '1c' => '1774', 'char' => 'БФ', 'number' => '002' ],
[ 'type' => 1, '1c' => '1772', 'char' => 'БФ', 'number' => '003' ],
[ 'type' => 1, '1c' => '3547', 'char' => 'ВГ', 'number' => '002' ],
[ 'type' => 1, '1c' => '1213', 'char' => 'ВГ', 'number' => '003' ],
[ 'type' => 1, '1c' => '1388', 'char' => 'ВК', 'number' => '004' ],
[ 'type' => 1, '1c' => '16957', 'char' => 'ВК', 'number' => '009' ],
[ 'type' => 1, '1c' => '17237', 'char' => 'ВК', 'number' => '013' ],
[ 'type' => 1, '1c' => '2282', 'char' => 'ВК', 'number' => '014' ],
[ 'type' => 1, '1c' => '1234', 'char' => 'ВК', 'number' => '015' ],
[ 'type' => 1, '1c' => '15411', 'char' => 'ВК', 'number' => '017' ],
[ 'type' => 1, '1c' => '1389', 'char' => 'ВК', 'number' => '019' ],
[ 'type' => 1, '1c' => '16863', 'char' => 'ВК', 'number' => '020' ],
[ 'type' => 1, '1c' => '11051', 'char' => 'ВК', 'number' => '021' ],
[ 'type' => 1, '1c' => '13194', 'char' => 'ВК', 'number' => '022' ],
[ 'type' => 1, '1c' => '17248', 'char' => 'ВК', 'number' => '027' ],
[ 'type' => 1, '1c' => '2503', 'char' => 'ВЛ', 'number' => '001' ],
[ 'type' => 1, '1c' => '17916', 'char' => 'ВЛ', 'number' => '003' ],
[ 'type' => 1, '1c' => '17917', 'char' => 'ВЛ', 'number' => '004' ],
[ 'type' => 1, '1c' => '17918', 'char' => 'ВЛ', 'number' => '005' ],
[ 'type' => 1, '1c' => '17920', 'char' => 'ВЛ', 'number' => '007' ],
[ 'type' => 1, '1c' => '17921', 'char' => 'ВЛ', 'number' => '009' ],
[ 'type' => 1, '1c' => '18313', 'char' => 'ВЛ', 'number' => '010' ],
[ 'type' => 1, '1c' => '18314', 'char' => 'ВЛ', 'number' => '011' ],
[ 'type' => 1, '1c' => '15396', 'char' => 'ВМ', 'number' => '002' ],
[ 'type' => 1, '1c' => '15880', 'char' => 'ВМ', 'number' => '003' ],
[ 'type' => 1, '1c' => '15879', 'char' => 'ВМ', 'number' => '004' ],
[ 'type' => 1, '1c' => '15997', 'char' => 'ВМ', 'number' => '007' ],
[ 'type' => 1, '1c' => '16956', 'char' => 'ВМ', 'number' => '008' ],
[ 'type' => 1, '1c' => '1785', 'char' => 'ВМ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1229', 'char' => 'ВМ', 'number' => '013' ],
[ 'type' => 1, '1c' => '953', 'char' => 'ВМ', 'number' => '014' ],
[ 'type' => 1, '1c' => '5010', 'char' => 'ВМ', 'number' => '015' ],
[ 'type' => 1, '1c' => '2222', 'char' => 'ВМ', 'number' => '018' ],
[ 'type' => 1, '1c' => '11046', 'char' => 'ВМ', 'number' => '024' ],
[ 'type' => 1, '1c' => '17919', 'char' => 'ВМ', 'number' => '026' ],
[ 'type' => 1, '1c' => '1348', 'char' => 'ВМ', 'number' => '027' ],
[ 'type' => 1, '1c' => '2239', 'char' => 'ВР', 'number' => '002' ],
[ 'type' => 1, '1c' => '11048', 'char' => 'ВС', 'number' => '001' ],
[ 'type' => 1, '1c' => '13738', 'char' => 'ВС', 'number' => '002' ],
[ 'type' => 1, '1c' => '5057', 'char' => 'ВС', 'number' => '004' ],
[ 'type' => 1, '1c' => '17238', 'char' => 'Г', 'number' => '001' ],
[ 'type' => 1, '1c' => '17239', 'char' => 'Г', 'number' => '002' ],
[ 'type' => 1, '1c' => '17240', 'char' => 'Г', 'number' => '003' ],
[ 'type' => 1, '1c' => '17241', 'char' => 'Г', 'number' => '004' ],
[ 'type' => 1, '1c' => '17243', 'char' => 'Г', 'number' => '006' ],
[ 'type' => 1, '1c' => '17244', 'char' => 'Г', 'number' => '007' ],
[ 'type' => 1, '1c' => '17245', 'char' => 'Г', 'number' => '008' ],
[ 'type' => 1, '1c' => '17247', 'char' => 'Г', 'number' => '010' ],
[ 'type' => 1, '1c' => '17249', 'char' => 'Г', 'number' => '012' ],
[ 'type' => 1, '1c' => '5029', 'char' => 'ГД', 'number' => '001' ],
[ 'type' => 1, '1c' => '2682', 'char' => 'ГМ', 'number' => '002' ],
[ 'type' => 1, '1c' => '5028', 'char' => 'ГМ', 'number' => '003' ],
[ 'type' => 1, '1c' => '6289', 'char' => 'ГМ', 'number' => '004' ],
[ 'type' => 1, '1c' => '16572', 'char' => 'ГМ', 'number' => '007' ],
[ 'type' => 1, '1c' => '15409', 'char' => 'ГМ', 'number' => '009' ],
[ 'type' => 1, '1c' => '5030', 'char' => 'ГМ', 'number' => '010' ],
[ 'type' => 1, '1c' => '1233', 'char' => 'ГМ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1782', 'char' => 'ГМ', 'number' => '015' ],
[ 'type' => 1, '1c' => '18497', 'char' => 'ГМ', 'number' => '019' ],
[ 'type' => 1, '1c' => '2224', 'char' => 'ГМ', 'number' => '025' ],
[ 'type' => 1, '1c' => '17246', 'char' => 'ГМ', 'number' => '026' ],
[ 'type' => 1, '1c' => '15414', 'char' => 'ГН', 'number' => '003' ],
[ 'type' => 1, '1c' => '6288', 'char' => 'ГН', 'number' => '011' ],
[ 'type' => 1, '1c' => '18376', 'char' => 'ГН', 'number' => '012' ],
[ 'type' => 1, '1c' => '15408', 'char' => 'ГО', 'number' => '002' ],
[ 'type' => 1, '1c' => '1283', 'char' => 'ГТ', 'number' => '003' ],
[ 'type' => 1, '1c' => '1345', 'char' => 'ГТ', 'number' => '006' ],
[ 'type' => 1, '1c' => '2294', 'char' => 'ГТ', 'number' => '021' ],
[ 'type' => 1, '1c' => '13730', 'char' => 'ГТ', 'number' => '028' ],
[ 'type' => 1, '1c' => '14870', 'char' => 'ГТ', 'number' => '029' ],
[ 'type' => 1, '1c' => '1781', 'char' => 'ГТ', 'number' => '030' ],
[ 'type' => 1, '1c' => '15998', 'char' => 'ГТ', 'number' => '032' ],
[ 'type' => 1, '1c' => '16845', 'char' => 'ГТ', 'number' => '036' ],
[ 'type' => 1, '1c' => '16959', 'char' => 'ГТ', 'number' => '037' ],
[ 'type' => 1, '1c' => '17925', 'char' => 'ГТ', 'number' => '041' ],
[ 'type' => 1, '1c' => '995', 'char' => 'Д', 'number' => '009' ],
[ 'type' => 1, '1c' => '956', 'char' => 'Д', 'number' => '013' ],
[ 'type' => 1, '1c' => '960', 'char' => 'Д', 'number' => '023' ],
[ 'type' => 1, '1c' => '1386', 'char' => 'Д', 'number' => '028' ],
[ 'type' => 1, '1c' => '1387', 'char' => 'Д', 'number' => '029' ],
[ 'type' => 1, '1c' => '1043', 'char' => 'Д', 'number' => '031' ],
[ 'type' => 1, '1c' => '16132', 'char' => 'Д', 'number' => '046' ],
[ 'type' => 1, '1c' => '2679', 'char' => 'Д', 'number' => '054' ],
[ 'type' => 1, '1c' => '2129', 'char' => 'Д', 'number' => '055' ],
[ 'type' => 1, '1c' => '981', 'char' => 'ДД', 'number' => '031' ],
[ 'type' => 1, '1c' => '976', 'char' => 'ДД', 'number' => '034' ],
[ 'type' => 1, '1c' => '11072', 'char' => 'ДЖ', 'number' => '001' ],
[ 'type' => 1, '1c' => '2119', 'char' => 'ДЖ', 'number' => '002' ],
[ 'type' => 1, '1c' => '15868', 'char' => 'ДЖ', 'number' => '011' ],
[ 'type' => 1, '1c' => '16000', 'char' => 'ДЖ', 'number' => '012' ],
[ 'type' => 1, '1c' => '16139', 'char' => 'ДЖ', 'number' => '013' ],
[ 'type' => 1, '1c' => '16434', 'char' => 'ДЖ', 'number' => '014' ],
[ 'type' => 1, '1c' => '16576', 'char' => 'ДЖ', 'number' => '015' ],
[ 'type' => 1, '1c' => '16846', 'char' => 'ДЖ', 'number' => '016' ],
[ 'type' => 1, '1c' => '16847', 'char' => 'ДЖ', 'number' => '017' ],
[ 'type' => 1, '1c' => '17251', 'char' => 'ДЖ', 'number' => '023' ],
[ 'type' => 1, '1c' => '1256', 'char' => 'ДЛ', 'number' => '023' ],
[ 'type' => 1, '1c' => '13150', 'char' => 'ДЛ', 'number' => '024' ],
[ 'type' => 1, '1c' => '13148', 'char' => 'ДЛ', 'number' => '025' ],
[ 'type' => 1, '1c' => '18498', 'char' => 'ДЛ', 'number' => '026' ],
[ 'type' => 1, '1c' => '13149', 'char' => 'ДЛ', 'number' => '028' ],
[ 'type' => 1, '1c' => '11071', 'char' => 'ДС', 'number' => '002' ],
[ 'type' => 1, '1c' => '16961', 'char' => 'ДС', 'number' => '006' ],
[ 'type' => 1, '1c' => '1780', 'char' => 'ЕС', 'number' => '002' ],
[ 'type' => 1, '1c' => '2157', 'char' => 'З', 'number' => '010' ],
[ 'type' => 1, '1c' => '16001', 'char' => 'З', 'number' => '013' ],
[ 'type' => 1, '1c' => '949', 'char' => 'З', 'number' => '017' ],
[ 'type' => 1, '1c' => '17030', 'char' => 'З', 'number' => '021' ],
[ 'type' => 1, '1c' => '17128', 'char' => 'З', 'number' => '022' ],
[ 'type' => 1, '1c' => '18315', 'char' => 'З', 'number' => '027' ],
[ 'type' => 1, '1c' => '1074', 'char' => 'З', 'number' => '036' ],
[ 'type' => 1, '1c' => '14867', 'char' => 'З', 'number' => '037' ],
[ 'type' => 1, '1c' => '19190', 'char' => 'З', 'number' => '040' ],
[ 'type' => 1, '1c' => '992', 'char' => 'ЗД', 'number' => '001' ],
[ 'type' => 1, '1c' => '5036', 'char' => 'ЗЗ', 'number' => '001' ],
[ 'type' => 1, '1c' => '18502', 'char' => 'ЗП', 'number' => '002' ],
[ 'type' => 1, '1c' => '18504', 'char' => 'ЗП', 'number' => '004' ],
[ 'type' => 1, '1c' => '5039', 'char' => 'ЛЖ', 'number' => '004' ],
[ 'type' => 1, '1c' => '16851', 'char' => 'ЛП', 'number' => '012' ],
[ 'type' => 1, '1c' => '17253', 'char' => 'ЛП', 'number' => '015' ],
[ 'type' => 1, '1c' => '1337', 'char' => 'ЛП', 'number' => '018' ],
[ 'type' => 1, '1c' => '13462', 'char' => 'ЛП', 'number' => '026' ],
[ 'type' => 1, '1c' => '1437', 'char' => 'ЛП', 'number' => '042' ],
[ 'type' => 1, '1c' => '1433', 'char' => 'ЛП', 'number' => '043' ],
[ 'type' => 1, '1c' => '16587', 'char' => 'ЛП', 'number' => '045' ],
[ 'type' => 1, '1c' => '2235', 'char' => 'ЛЦ', 'number' => '014' ],
[ 'type' => 1, '1c' => '15869', 'char' => 'ЛЦ', 'number' => '016' ],
[ 'type' => 1, '1c' => '16003', 'char' => 'ЛЦ', 'number' => '017' ],
[ 'type' => 1, '1c' => '16585', 'char' => 'ЛЦ', 'number' => '025' ],
[ 'type' => 1, '1c' => '16966', 'char' => 'ЛЦ', 'number' => '028' ],
[ 'type' => 1, '1c' => '16967', 'char' => 'ЛЦ', 'number' => '030' ],
[ 'type' => 1, '1c' => '17255', 'char' => 'ЛЦ', 'number' => '035' ],
[ 'type' => 1, '1c' => '17256', 'char' => 'ЛЦ', 'number' => '036' ],
[ 'type' => 1, '1c' => '965', 'char' => 'ЛЦ', 'number' => '038' ],
[ 'type' => 1, '1c' => '17928', 'char' => 'ЛЦ', 'number' => '040' ],
[ 'type' => 1, '1c' => '17929', 'char' => 'ЛЦ', 'number' => '041' ],
[ 'type' => 1, '1c' => '2118', 'char' => 'ЛЦ', 'number' => '044' ],
[ 'type' => 1, '1c' => '16075', 'char' => 'ЛЦ', 'number' => '047' ],
[ 'type' => 1, '1c' => '17340', 'char' => 'ЛЦ', 'number' => '052' ],
[ 'type' => 1, '1c' => '17408', 'char' => 'ЛЦ', 'number' => '058' ],
[ 'type' => 1, '1c' => '6295', 'char' => 'ЛЦ', 'number' => '060' ],
[ 'type' => 1, '1c' => '7945', 'char' => 'ЛЦ', 'number' => '061' ],
[ 'type' => 1, '1c' => '2164', 'char' => 'М', 'number' => '002' ],
[ 'type' => 1, '1c' => '1274', 'char' => 'МБ', 'number' => '002' ],
[ 'type' => 1, '1c' => '3544', 'char' => 'МВ', 'number' => '003' ],
[ 'type' => 1, '1c' => '6280', 'char' => 'МГ', 'number' => '001' ],
[ 'type' => 1, '1c' => '6281', 'char' => 'МГ', 'number' => '002' ],
[ 'type' => 1, '1c' => '13140', 'char' => 'МГ', 'number' => '004' ],
[ 'type' => 1, '1c' => '14876', 'char' => 'МГ', 'number' => '005' ],
[ 'type' => 1, '1c' => '14877', 'char' => 'МГ', 'number' => '006' ],
[ 'type' => 1, '1c' => '14878', 'char' => 'МГ', 'number' => '007' ],
[ 'type' => 1, '1c' => '1254', 'char' => 'МГ', 'number' => '008' ],
[ 'type' => 1, '1c' => '17931', 'char' => 'МГ', 'number' => '010' ],
[ 'type' => 1, '1c' => '1041', 'char' => 'МГ', 'number' => '012' ],
[ 'type' => 1, '1c' => '18510', 'char' => 'МГ', 'number' => '014' ],
[ 'type' => 1, '1c' => '18511', 'char' => 'МГ', 'number' => '015' ],
[ 'type' => 1, '1c' => '2504', 'char' => 'МД', 'number' => '003' ],
[ 'type' => 1, '1c' => '5043', 'char' => 'МД', 'number' => '004' ],
[ 'type' => 1, '1c' => '15413', 'char' => 'МД', 'number' => '005' ],
[ 'type' => 1, '1c' => '16854', 'char' => 'МД', 'number' => '006' ],
[ 'type' => 1, '1c' => '2184', 'char' => 'МД', 'number' => '008' ],
[ 'type' => 1, '1c' => '1066', 'char' => 'МД', 'number' => '013' ],
[ 'type' => 1, '1c' => '12085', 'char' => 'МД', 'number' => '015' ],
[ 'type' => 1, '1c' => '16855', 'char' => 'МК', 'number' => '001' ],
[ 'type' => 1, '1c' => '16970', 'char' => 'МК', 'number' => '005' ],
[ 'type' => 1, '1c' => '17031', 'char' => 'МК', 'number' => '006' ],
[ 'type' => 1, '1c' => '17131', 'char' => 'МК', 'number' => '008' ],
[ 'type' => 1, '1c' => '13128', 'char' => 'МК', 'number' => '009' ],
[ 'type' => 1, '1c' => '8244', 'char' => 'МК', 'number' => '027' ],
[ 'type' => 1, '1c' => '2180', 'char' => 'МЛ', 'number' => '003' ],
[ 'type' => 1, '1c' => '18379', 'char' => 'ММ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1223', 'char' => 'ММ', 'number' => '013' ],
[ 'type' => 1, '1c' => '1044', 'char' => 'ММ', 'number' => '014' ],
[ 'type' => 1, '1c' => '16586', 'char' => 'ММ', 'number' => '016' ],
[ 'type' => 1, '1c' => '1377', 'char' => 'МТ', 'number' => '010' ],
[ 'type' => 1, '1c' => '2683', 'char' => 'МХ', 'number' => '001' ],
[ 'type' => 1, '1c' => '13138', 'char' => 'МХ', 'number' => '003' ],
[ 'type' => 1, '1c' => '1285', 'char' => 'Н', 'number' => '001' ],
[ 'type' => 1, '1c' => '3541', 'char' => 'НА', 'number' => '007' ],
[ 'type' => 1, '1c' => '16590', 'char' => 'НА', 'number' => '008' ],
[ 'type' => 1, '1c' => '1263', 'char' => 'НЛ', 'number' => '004' ],
[ 'type' => 1, '1c' => '11056', 'char' => 'НЛ', 'number' => '011' ],
[ 'type' => 1, '1c' => '15871', 'char' => 'НЛ', 'number' => '012' ],
[ 'type' => 1, '1c' => '16971', 'char' => 'НЛ', 'number' => '014' ],
[ 'type' => 1, '1c' => '2167', 'char' => 'НЛ', 'number' => '028' ],
[ 'type' => 1, '1c' => '1212', 'char' => 'НЛ', 'number' => '033' ],
[ 'type' => 1, '1c' => '9432', 'char' => 'НЛ', 'number' => '036' ],
[ 'type' => 1, '1c' => '15415', 'char' => 'НТ', 'number' => '002' ],
[ 'type' => 1, '1c' => '5046', 'char' => 'ОК', 'number' => '003' ],
[ 'type' => 1, '1c' => '14113', 'char' => 'ОЛ', 'number' => '007' ],
[ 'type' => 1, '1c' => '17132', 'char' => 'ОТ', 'number' => '013' ],
[ 'type' => 1, '1c' => '1269', 'char' => 'ОТ', 'number' => '021' ],
[ 'type' => 1, '1c' => '1282', 'char' => 'ОТ', 'number' => '022' ],
[ 'type' => 1, '1c' => '17937', 'char' => 'П', 'number' => '003' ],
[ 'type' => 1, '1c' => '15872', 'char' => 'ПИ', 'number' => '003' ],
[ 'type' => 1, '1c' => '16004', 'char' => 'ПИ', 'number' => '004' ],
[ 'type' => 1, '1c' => '8245', 'char' => 'ПИ', 'number' => '005' ],
[ 'type' => 1, '1c' => '16428', 'char' => 'ПИ', 'number' => '007' ],
[ 'type' => 1, '1c' => '3538', 'char' => 'ПЛ', 'number' => '001' ],
[ 'type' => 1, '1c' => '1338', 'char' => 'ПР', 'number' => '001' ],
[ 'type' => 1, '1c' => '14862', 'char' => 'ПФ', 'number' => '003' ],
[ 'type' => 1, '1c' => '14863', 'char' => 'ПФ', 'number' => '004' ],
[ 'type' => 1, '1c' => '1277', 'char' => 'ПЦ', 'number' => '001' ],
[ 'type' => 1, '1c' => '2241', 'char' => 'Р', 'number' => '001' ],
[ 'type' => 1, '1c' => '5053', 'char' => 'Р', 'number' => '003' ],
[ 'type' => 1, '1c' => '5052', 'char' => 'Р', 'number' => '004' ],
[ 'type' => 1, '1c' => '5050', 'char' => 'РС', 'number' => '003' ],
[ 'type' => 1, '1c' => '2117', 'char' => 'РС', 'number' => '018' ],
[ 'type' => 1, '1c' => '3606', 'char' => 'РС', 'number' => '019' ],
[ 'type' => 1, '1c' => '2132', 'char' => 'РТ', 'number' => '001' ],
[ 'type' => 1, '1c' => '984', 'char' => 'РТ', 'number' => '003' ],
[ 'type' => 1, '1c' => '13742', 'char' => 'РТ', 'number' => '004' ],
[ 'type' => 1, '1c' => '17134', 'char' => 'РТ', 'number' => '005' ],
[ 'type' => 1, '1c' => '16570', 'char' => 'РТ', 'number' => '006' ],
[ 'type' => 1, '1c' => '13460', 'char' => 'РТ', 'number' => '007' ],
[ 'type' => 1, '1c' => '15422', 'char' => 'РТ', 'number' => '008' ],
[ 'type' => 1, '1c' => '977', 'char' => 'РТ', 'number' => '009' ],
[ 'type' => 1, '1c' => '16611', 'char' => 'РТ', 'number' => '011' ],
[ 'type' => 1, '1c' => '1198', 'char' => 'РТ', 'number' => '012' ],
[ 'type' => 1, '1c' => '2513', 'char' => 'РТ', 'number' => '013' ],
[ 'type' => 1, '1c' => '15402', 'char' => 'РТ', 'number' => '014' ],
[ 'type' => 1, '1c' => '2137', 'char' => 'РТ', 'number' => '016' ],
[ 'type' => 1, '1c' => '2143', 'char' => 'РТ', 'number' => '017' ],
[ 'type' => 1, '1c' => '2236', 'char' => 'РТ', 'number' => '018' ],
[ 'type' => 1, '1c' => '13126', 'char' => 'РТ', 'number' => '019' ],
[ 'type' => 1, '1c' => '18924', 'char' => 'РТ', 'number' => '063' ],
[ 'type' => 1, '1c' => '18763', 'char' => 'РТ', 'number' => '104' ],
[ 'type' => 1, '1c' => '11052', 'char' => 'С', 'number' => '009' ],
[ 'type' => 1, '1c' => '17939', 'char' => 'С', 'number' => '011' ],
[ 'type' => 1, '1c' => '1250', 'char' => 'С', 'number' => '013' ],
[ 'type' => 1, '1c' => '16975', 'char' => 'СВ', 'number' => '015' ],
[ 'type' => 1, '1c' => '16569', 'char' => 'СЖ', 'number' => '020' ],
[ 'type' => 1, '1c' => '1789', 'char' => 'СЖ', 'number' => '022' ],
[ 'type' => 1, '1c' => '18517', 'char' => 'СЖ', 'number' => '023' ],
[ 'type' => 1, '1c' => '18745', 'char' => 'СЖ', 'number' => '028' ],
[ 'type' => 1, '1c' => '17267', 'char' => 'СМ', 'number' => '014' ],
[ 'type' => 1, '1c' => '16601', 'char' => 'СШ', 'number' => '006' ],
[ 'type' => 1, '1c' => '17032', 'char' => 'Ф', 'number' => '019' ],
[ 'type' => 1, '1c' => '17941', 'char' => 'Ф', 'number' => '022' ],
[ 'type' => 1, '1c' => '18928', 'char' => 'Ф', 'number' => '031' ],
[ 'type' => 1, '1c' => '16607', 'char' => 'ФИ', 'number' => '005' ],
[ 'type' => 1, '1c' => '13736', 'char' => 'ЧМ', 'number' => '004' ],
[ 'type' => 1, '1c' => '969', 'char' => 'ЧМ', 'number' => '011' ],
[ 'type' => 1, '1c' => '16610', 'char' => 'ЧМ', 'number' => '012' ],
[ 'type' => 1, '1c' => '16602', 'char' => 'ЧМ', 'number' => '013' ],
[ 'type' => 1, '1c' => '2283', 'char' => 'ЧМ', 'number' => '030' ],
[ 'type' => 1, '1c' => '17922', 'char' => 'ЧМ', 'number' => '032' ],
[ 'type' => 1, '1c' => '18932', 'char' => 'ЧМ', 'number' => '038' ],
[ 'type' => 1, '1c' => '19217', 'char' => 'ЧМ', 'number' => '045' ],
    	];

		$this->aSku = [
			[	'char' => 'А',
				'number' => [ 6 ]],
			[	'char' => 'БР',
				'number' => [ 8, 9, 14, 15, 16 ]],
			[	'char' => 'ВК',
				'number' => [ 10, 12, 16, 18, 19, 20, 21, 24, 25, 26, 29, 30 ]],
			[	'char' => 'ВМ',
				'number' => [ 1, 3, 5, 9, 10, 11, 12, 14, 15, 16, 17, 19, 20, 21, 23, 24, 25, 26, 27 ]],
			[	'char' => 'ВС',
				'number' => [ 5, 6, 8, 10 ]],
			[	'char' => 'ГМ',
				'number' => [ 11, 12, 21, 22, 23, 14, 15, 17, 18 ]],
			[	'char' => 'ГН',
				'number' => [ 3, 4, 5, 6, 7, 8, 9, 11, 12, 13, 14 ]],
			[	'char' => 'ГТ',
				'number' => [ 20, 21, 26, 27, 38, 39, 40, 41, 35, 37 ]],
			[	'char' => 'ДЖ',
				'number' => [ 13, 18, 19, 23, 26, 27, 28, 32, 33, 34, 35, 36, 37 ]],
			[	'char' => 'ДЛ',
				'number' => [ 22, 24, 26, 27, 28, 29, 30, 32, 33 ]],
			[	'char' => 'З',
				'number' => [ 1, 10, 17, 18, 19, 22, 24, 25, 26, 28, 30, 31, 32, 33, 35, 36, 37, 38, 41, 44 ]],
			[	'char' => 'КИ',
				'number' => [ 2, 3, 4, 5, 6, 7, 8 ]],
			[	'char' => 'ЛП',
				'number' => [ 14, 15, 16, 18, 21, 22, 23, 24, 25, 26, 28, 29, 30, 33, 35, 36, 38, 39, 40, 41, 43, 45, 46 ]],
			[	'char' => 'ЛЦ',
				'number' => [ 23, 25, 26, 27, 28, 31, 32, 34, 35, 37, 39, 41, 42, 43, 45, 46, 48, 49, 50, 51, 52, 53, 54, 55, 60, 61, 62 ]],
			[	'char' => 'МГ',
				'number' => [ 9, 10, 11, 12, 13, 17 ]],
			[	'char' => 'МД',
				'number' => [ 7, 9, 10, 11, 12, 13, 14, 15, 16, 17 ]],
			[	'char' => 'МК',
				'number' => [ 4, 5, 7, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 28, 29, 30, 32, 33, 34, 35 ]],
			[	'char' => 'МЛ',
				'number' => [ 12 ]],
			[	'char' => 'НЛ',
				'number' => [ 15, 17, 18, 19, 25, 27, 28, 29, 30, 32, 33, 36, 42, 43 ]],
			[	'char' => 'ПИ',
				'number' => [ 1, 2, 9, 10 ]],
			[	'char' => 'ПФ',
				'number' => [ 4, 7, 8, 10, 12, 13 ]],
			[	'char' => 'РС',
				'number' => [ 10, 11, 13, 14, 17, 18, 19, 20 ]],
			[	'char' => 'РП',
				'number' => [ 7, 8, 9, 10 ]],
			[	'char' => 'РТ',
				'number' => [ 4, 5, 7, 8, 9, 11, 12, 13, 14, 15, 17, 18, 20, 21, 23, 24, 25, 26, 27, 28, 36, 37, 42, 73, 75, 76 ]],
			[	'char' => 'С',
				'number' => [ 1, 3, 5, 6, 7, 8, 9, 12, 13 ]],
			[	'char' => 'СВ',
				'number' => [ 1, 3, 4, 5, 7, 8, 9, 10, 11, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27 ]],
			[	'char' => 'СЖ',
				'number' => [ 12, 16, 17, 20, 21, 22, 23, 26, 27, 28, 29, 30, 38, 40, 41 ]],
			[	'char' => 'СМ',
				'number' => [ 12, 14, 16, 18, 22 ]],
			[	'char' => 'Ф',
				'number' => [ 6, 17, 19, 20, 21, 22, 23, 27, 28, 29, 30, 31, 32 ]],
			[	'char' => 'ЦК',
				'number' => [ 1, 2, 3, 4 ]],
			[	'char' => 'ЧМ',
				'number' => [ 3, 5, 8, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 37, 38, 39, 40, 41, 42, 44, 45, 46 ]],
			[	'char' => 'ЧС',
				'number' => [ 1 ]],		
		];
	}


	function checkSku($product){
		preg_match('/([а-яёА-Я]+)-(\d+)/', $product['sku'], $matches);
		// print_r($matches);
		echo "count == ".count($matches)."\n";
		if (count($matches) == 3){
			$skuChar = $matches[1];
			$skuNum = $matches[2];
			foreach ($this->aSku as $itemSku){
				if ($itemSku['char'] == $skuChar){
					foreach ($itemSku['number'] as $n){
						if ($n == $skuNum){
							return true;
						}
					}
				}
			}
		}
		return false;
	}



	public function get1cFromSku($product){
    	$sku = [];
    	$strSku = '';
		if (preg_match('/^([а-яёА-Я]+)-(\d+)/', $product['sku'], $matches)) {
			$sku['type'] = self::SKU_CHAR_NUMBER;
			$sku['char'] = $matches[1];
			$sku['number'] = $matches[2]; 
			$strSku = $sku['type']."/".$sku['char']."/".$sku['number'];							
		}
		if (count($sku) == 0){
			$sku['type'] = self::SKU_NONE;
			echo "Error: sku == ".$product['sku']." / name == ".$product['name']."no detect sku!\n";
		}else{
			echo "			sku == ".$product['sku']." ".$strSku."\n";
		}
		//print_r($sku);
    	foreach ($this->aSku1c as $sku1c){
			if ($sku['type'] == $sku1c['type']){
				switch ($sku['type']) {
					case self::SKU_CHAR_NUMBER:
						if ((int)$sku['number'] == (int)$sku1c['number'] && $sku['char'] == $sku1c['char']){
							return $sku1c['1c'];
						}
						break;										
				}
			}	    		
    	}
    }



	function parseSet($url){
		$aKey = [
			[ 'productKey' => 'author',  	'key' => 'Дизайнер' ],
			[ 'productKey' => 'size',  		'key' => 'Размер' ],
			[ 'productKey' => 'canva',  	'key' => 'Канва' ],		
			[ 'productKey' => 'colorCount',  'key' => 'Количество цветов' ],				
		];
		$html = file_get_html($url);
		$product = [];
		$product['urlSrc'] = $url;
		$div = $html->find('.title', 0);
		$h1 = $div->find('h1', 0);
		echo "h1 == ".$h1->plaintext."\n";  
		if (preg_match('/МК-021/', $h1->plaintext)) {
			$matches[1] = "МК-021";
			$matches[2] = "Девушка с жемчужной сережкой";  
		}elseif(preg_match('/МТ-002/', $h1->plaintext)){
			$matches[1] = "МТ-002";
			$matches[2] = "Год лошади";		
		}else{
			preg_match('/([а-яёА-Я]+-\d+)\s+(.+)/', $h1->plaintext, $matches);
			if (count($matches) == 0){
				preg_match('/([а-яёА-Я]+-\d+\/\d+)\s+(.+)/', $h1->plaintext, $matches);
			}		
		}
		if (count($matches) == 0){
			$product['sku']  = '';
			$product['name'] = $h1->plaintext;
		}else{
			$product['sku']  = $matches[1];
			$product['name'] = $matches[2];			
		}
		//$product['id1C'] = $this->findId1c($product['sku']);
		$product['colorCode'] = 0;		

		foreach ($html->find('.mainImg') as $div) {
			foreach ($div->find('img') as $img) {
				$patterns = array();
				$patterns[0] = '/\/\/www/';
				$replacements = array();
				$replacements[0] = 'www';
				$product['imgUrl'] =  preg_replace($patterns, $replacements, $img->src);

				if (preg_match('/jpg/', $img->src)){
					preg_match('/\/(\w+\.jpg\?\d+)/', $img->src, $matches);						
				}
				if (preg_match('/jpeg/', $img->src)){
					preg_match('/\/(\w+\.jpeg\?\d+)/', $img->src, $matches);			
				}
				$product['imgFile'] = '';
				if (count($matches) == 2){
					//echo "matches[1] == ".$img->src."\n";
					$product['imgFile'] = $matches[1];
				}

			}
		}

		foreach ($html->find('.bx_item_description') as $div) {
			$a = explode("\n", $div->plaintext);
			$isTxt = 0;
			$product['content'] = '';
			foreach ($a as $str){
				$str = trim($str);
				if (strlen($str) == 0){
					$isTxt = 1;
				}else{
					if ($isTxt){
						$product['content'] .= $str;
					}else{
						if ($this->findKey($str, $aKey, $key, $val)){
							$product[$key] = $val;
						}else{												
							if (preg_match('/Вышивается/', $str, $matches)){
								$product['tech'] = $str;
							}
							if (preg_match('/В набор включается/', $str, $matches)){
								$isTxt = 1;
							}
						}
					}
				}
			}
		}
		$product['txt'] = '';
		$product['isOrder'] = false;
		foreach ($html->find('.longDesc') as $div) {
			foreach ($div->find('dl') as $dl) {
				$aDl = $dl->children();
				for ($i=0; $i < count($aDl); $i+=2){
					$key = trim($aDl[$i]->plaintext);
					$val = trim($aDl[$i+1]->plaintext);	
					// echo ('Актуальность' == $key). " ".$key."\n"; 
					// echo ('Под заказ' == $val). " ".$val."\n";
					if ('Актуальность' == $key && 'Под заказ' == $val){
						$product['isOrder'] = true;
					}
					if ('Серия' == $key){
						$product['categoryName'] = $val;
					}				
				}
			}
		}
		$div = $html->find('.priceBlock', 0);
		preg_match('/\s+Цена\s+([\d\w&;]+)\s+/', $div->plaintext, $matches);
		$patterns = array();
		$patterns[0] = '/&nbsp;/';
		$replacements = array();
		$replacements[0] = '';
		$product['price'] =  preg_replace($patterns, $replacements, $matches[1]);
	  	return $product;
	}


	function getCategoryId($product){
		global  $parent_id;
		foreach ($this->aCategory as $cat){
			if ($cat['name'] == $product['categoryName']){
				return $cat['id'];
			}
		}
		$catData = [
			'parent_id' => $parent_id,
			'name' => $product['categoryName'],
			'txt' => '',
		];
		insertCategory($catData);
		preg_match('/([а-яёА-Я]+)-\d+/', $product['sku'], $matches);
		array_push($this->aCategory, [
				'name' => $product['categoryName'],
				'id' => $catData['category_id'],
				'charSku' => $matches[1]
			]);
		// echo "aCatData == ";
		// print_r($catData);
		// echo "\n";	
		// echo "aCategory == ";	
		// print_r($aCategory);
		// echo "\n";		
		return $catData['category_id'];
	}


	function parseCatalog($url){
		$html = file_get_html($url);

		foreach($html->find('.item') as $div){
			$h4 = $div->find('h4', 0);
			$a = $h4->find('a', 0);
			$product = $this->parseSet('http://www.rukodelie.ru'.$a->href);
			//if ($this->checkSku($product)){
				$product['idManufacturer'] = $this->manufacturerId;
				$product['idCategory'] = $this->categoryId;  //$this->getCategoryId($product);
				echo "product == ";
				print_r($product);
				if ($id1C = $this->get1CFromSku($product)){
					$product['id1C'] = $id1C;
					echo "sku->1c ok: id1C == ".$id1C."name == ".$product['name']."\n";
					$this->saveProduct($product);	
				}else{
					echo "!!! Error: sku == ".$product['sku']." name == ".$product['name']." no found Id1c \n";
				}				
				//$this->insertProduct($product);
			//}
			sleep(2);	
		}
	}
	

	function parseCategory($url){
		$html = file_get_html($url);

		foreach($html->find('.bx_filter_parameters_box_container') as $div){
			foreach ($div->find('span') as $span) {
				echo trim($span->plaintext)."\n";	
			}
		}
	}


    public function actionIndex($mode){
    	if ($mode == 'fill'){
			$this->parseCatalog('http://www.rukodelie.ru/catalog/Nabory_dlya_vyshivaniya/nabory_dlya_vyshivaniya_krestom/');
			for ($i=2; $i <= 81; $i++) { 
				$this->parseCatalog('http://www.rukodelie.ru/catalog/Nabory_dlya_vyshivaniya/nabory_dlya_vyshivaniya_krestom/?PAGEN_1='.$i);			
			}        		
    	}
    	if ($mode == 'sku_1c'){
    		$this->getSku();
    	}
	
    }


	public function getSku(){
		$kolEmpty = 0;
		$kolOk = 0;
		foreach (Product::find()->where(['idCategory' => $this->categoryId])->all() as $product){
			$sku = [];
			$name = $product->nameFull;
			if (preg_match('/^([а-яёА-Я]+)-(\d+)/', $name, $matches)) {
				$sku['type'] = self::SKU_CHAR_NUMBER;
				$sku['char'] = $matches[1];
				$sku['number'] = $matches[2]; 											
			}else{
				//echo "bad sku: ".$name."\n";
			}				
			if (count($sku) == 0){
				$kolEmpty++;
			}else{
				$kolOk++;
				echo "[ 'type' => ".$sku['type'].", '1c' => '".$product['id1C']."',";
				switch ($sku['type']) {
					case self::SKU_CHAR_NUMBER:
						echo " 'char' => '".$sku['char']."', 'number' => '".$sku['number']."' ],\n";
						break;
					case self::SKU_NUMBER_NUMBER:
						echo " 'number1' => '".$sku['number1']."', 'number2' => '".$sku['number2']."' ],\n";
						break;		
					case self::SKU_NUMBER:
						echo " 'number' => '".$sku['number']."' ],\n";
						break;											
				}
			}
		}
	}


}
