<?php

echo "in tkaniVelur\n";

$price = 690;
$width = 140;
$idProduct = 13;

$aColors = [
	[ '1c' => 10719, 'sku' => 'велюр 3497',  'colorName' => 'фуксия' ],
	[ '1c' => 11427, 'sku' => 'велюр 3032',  'colorName' => 'фиолетовый' ],
	[ '1c' => 11446, 'sku' => 'велюр 3211',  'colorName' => 'грязно-лиловый' ],
	[ '1c' => 8904,  'sku' => 'велюр 1179', 'colorName' => 'салатовый' ],	
	[ '1c' => 19129, 'sku' => 'велюр 3039',  'colorName' => 'золотистый' ],
	[ '1c' => 11639, 'sku' => 'велюр 3038', 'colorName' => 'светло-серый' ],	

	[ '1c' => 11638, 'sku' => 'велюр EMBOS 3497',  'colorName' => 'фуксия' ],
	[ '1c' => 11407, 'sku' => 'велюр EMBOS 3032',  'colorName' => 'фиолетовый' ],
	[ '1c' => 11404, 'sku' => 'велюр EMBOS 3211',  'colorName' => 'грязно-лиловый' ],
	[ '1c' => 11402, 'sku' => 'велюр EMBOS 1779', 'colorName' => 'салатовый' ],	
	[ '1c' => 11359, 'sku' => 'велюр EMBOS 3039',  'colorName' => 'золотистый' ],
	[ '1c' => 11439, 'sku' => 'велюр EMBOS 3038', 'colorName' => 'светло-серый' ],		
];

