<?php

echo "in tkaniJakkard2\n";

$price = 1250;
$width = 140;
$idProduct = 14;

$aColors = [
	[ '1c' => 11381, 'sku' => 'CARLOS 1000',   'colorName' => 'кремовый' ],	
	[ '1c' => 12437, 'sku' => 'CARLOS 1130',   'colorName' => 'ментол' ],
	[ '1c' => 11648, 'sku' => 'ELLA 1046/01',  'colorName' => 'светло-бежевый' ],	
	[ '1c' => 10170,  'sku' => 'ELLA 1046/01',  'colorName' => 'светло-бежевый (компаньон)', 'price' => 1100 ],	
	[ '1c' => 10171, 'sku' => 'ELLA 1046/04',  'colorName' => 'светлый-персик' ],	
	[ '1c' => 10184, 'sku' => 'ELLA 1046/04',  'colorName' => 'светлый-персик (компаньон)', 'price' => 1100 ],
	[ '1c' => 11419, 'sku' => 'ELLA 1046/183', 'colorName' => 'светлое-золото' ],	
	[ '1c' => 8912,  'sku' => 'ELLA 1046/183', 'colorName' => 'светлое-золото (компаньон)', 'price' => 1100 ],
	[ '1c' => 11339, 'sku' => 'ELLA 1130/03',  'colorName' => 'ментол' ],	
	[ '1c' => 10159, 'sku' => 'ELLA 1130/03',  'colorName' => 'ментол (компаньон)', 'price' => 1100 ],
	[ '1c' => 11272, 'sku' => 'LOTUS 322504',   'colorName' => 'бирюзовый (компаньон)', 'price' => 1100 ],	
	[ '1c' => 11513, 'sku' => 'LOTUS 322504',   'colorName' => 'бирюзовый' ],
	[ '1c' => 4153,  'sku' => 'LOTUS 105101',   'colorName' => 'темно-коричневый (компаньон)', 'price' => 1100 ],
	[ '1c' => 4155,  'sku' => 'LOTUS 105101',   'colorName' => 'темно-коричневый ' ],	
	[ '1c' => 14069, 'sku' => 'LOTUS 322401',   'colorName' => 'кремовый (компаньон)', 'price' => 1100 ],
	[ '1c' => 11268, 'sku' => 'LOTUS 322401',   'colorName' => 'кремовый' ],
	[ '1c' => 11273, 'sku' => 'LOTUS 116101',   'colorName' => 'горчично-коричневый (компаньон)', 'price' => 1100 ],
	[ '1c' => 10259, 'sku' => 'LOTUS 116101',   'colorName' => 'горчично-коричневый' ],	
];

